#+BEGIN_EXPORT html
---
layout: page
title: Organize Your Work
tagline: " with a minimum interruptions"
permalink: /professional/workflow_inside_org_mode.html
categories: [workflow, org-mode, effeciency, Emacs, Zettelkasten]
tags: [data gathering, data elaboration, notetaking]
---
#+END_EXPORT

#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export
#+CATEGORY: Workflow
#+TODO: RAW INIT TODO ACTIVE | DONE
#+TODO: DELAY LAG RETARD | STARK
#+TODO: | FROZEN

* Preamble

I am an originator of my task management system!

Without a shadow of doubt the managing your tasks galore is a
/meta-task/ that is vitally important to release your vocation in a
/productive/ *and* /effective/ manner.

#+begin_quote

*Productive* here means /apt to gain an evident result/.
*Effective* here means /apt to achieve the aim faster/.

#+end_quote

The paragon aim is to do your best with sincere joy, playfully
focusing on each particular task in a preliminarily defined
sequence. Yes, it sounds appealing, but it might be a /herculian
effort/ to resolve this issue neglecting several well-known nowadays
pequliarities of human cognition.

In times of crisis, many of us ponder existential questions about health,
security, purpose, career, family, and legacy. However, more often than
not, such contemplation is short-lived. The demands of everyday life — the
here and now — can overwhelm us, leaving little time to think about the
long term and what we are working toward. As a result, when faced with
life decisions both big and small, we are left with nothing to guide us
but emotion or intuition.


* Premises

** Biology

We are the living organisms, thus the lion's share of our nature is
predefined by the large set of natural laws. The first and foremost
for any living creature are:

- Safety, as a premise for survival;
- Reproduction, as a cornerstone of life itself;

Evolutionally the pledge of success in resolving these tough tasks was
our /ability to unite in groups and cooperate with one another/. The
modern science names it /socialising/. And this pecularity yields
another sub-set of human-only demands:

- Ability to share our resources amongst members of our group;
- Abilyto to learn one from another;
- Engagement into the fight for the dominance in our group;

  
*** Hunger

Undoubtly, it is the cornerstone of safety for all creatures with no
exception.

**** Instant reward

Is a basement for all types of /right/ actions. In opposite, - /wrong/
actions don't give instant reward.

**** Delayed reward

~Human-only~ faculty to imagine a positive consequence of /actions
with no instant reward/.

**** [[https://en.wikipedia.org/wiki/Stanford_marshmallow_experiment][Marshmallow test]]

It explicitly unvails a craving suppression hypothesis:

#+begin_quote
Individuals who can resist a temptation to eat a bait are potentially
more successful in life.
#+end_quote

**** Applicability

The most potent and powerful drive to gain knowledge first with
delayed gratification by food a little bit later.


*** Circadian rhythms

In the morning when you're much productive than ever.

*** Distractions

Naturally they serves as a /back to reality/ mechanism.

*** Rehearsal
So, lets dismantle several classical approaches to this
quite delicate issue:

+ ToDo lists;
+ Time-table;
+ Calendar.

Arguably, but all these tools and a lot more are already inculuded
into the ~Emacs'~ ~Org-mode~ package, and all you're need to do - just
read its documentation. Yes, it is not easy to do, so we are on the
right path.



* The postulates

** Write down everything

that it is possible to write.

It is the /fleeting notes/ spawning. Yes, they are raw, but it is the
case to find a =pearl in the mud=. Just be patient.

** All that was written

ought to be reviewed several times, categorised and evaluated. Yes, it requires a
lot of time, it is a rough task and demands a Herculian effort and a
lot of time.

** The insight requires an incubation

As the pure diamond requires to be elaborated to refine its unique
startling properties, the ~raw note~ is seldom ready for contemplating
about its essence. A context matters!

** Rectify them

Often it is useful to rephrase it to obtain clarity.

** Entwine them together

Often they are interrelated. Be cautious, please!

** Pomodoro

** Change task to avoid einstulling


* A natrual way to make notes

Historically all this fuss around the notes has been successfully
resolved a million years in a row simply inside the one's
skull. Usually _Homo_ just remember what he wants to know in the
nearby future. Yes, this approach has a ton of caveats:

- Durability;
- Precision;
- Distortion;
- etc.

* A synthetic way of note-taking

Not so far /a literacy/ spreaded across a globe and nowadays in
particular every _Homo_ can read and write. So, literally it might be
implemented by a single ~master~ ToDo list for general tasks, and a
bundle of ~slave~ ToDo lists, connected and disconnected optionally,
depending on current job properties.

 + Task management;
 + Data gathering;
 + Data elaboration
 + Meta-analysys

* Emacs' standpoint

** The Org Agenda

#+begin_quote
Due to the way Org works, TODO items, time-stamped items, and tagged
headlines can be scattered throughout a file or even a number of
files.  To get an overview of open action items, or of events that are
important for a particular date, this information must be collected,
sorted and displayed in an organized way.
#+end_quote


#+begin_quote
Entries in the agenda buffer are linked back to the Org file or diary
file where they originate.  You are not allowed to edit the agenda
buffer itself, but commands are provided to show and jump to the
original entry location, and to edit the Org files “remotely” from the
agenda buffer.  In this way, all information is stored only once,
removing the risk that your agenda and note files may diverge.
#+end_quote

For a much detailed overview each item might be extendeid in a
separate buffer:

#+begin_quote
(‘org-agenda-tree-to-indirect-buffer’)
     Display the entire subtree of the current item in an indirect
     buffer.  With a numeric prefix argument N, go up to level N and
     then take that tree.  If N is negative, go up that many levels.
     With a ‘C-u’ prefix, do not remove the previously used indirect
     buffer.
#+end_quote

** Toolset

Separate EWW window for each task  -- does its history also splitted?
Does Desktop-Save saves their properties also?



Separate set of bookmarks for each task

* Average modes

** TODO Task management                                               :bait:
SCHEDULED: <2024-05-17 Fri .+4d/5d>
:PROPERTIES:
:LAST_REPEAT: [2022-12-03 Sat 09:27]
:CATEGORY: Manage
:END:
- State "DONE"       from "ACTIVE"     [2022-12-03 Sat 09:27]
- State "MAYBE"      from "ACTIVE"     [2022-11-18 Fri 07:32]
- Note taken on [2022-11-16 Wed 17:26] \\
  So it is neccessary to re-order =TODO= files and switch *Org-Agenda* on
  them.
:LOGBOOK:
CLOCK: [2022-11-15 Tue 19:02]--[2022-11-15 Tue 19:17] =>  0:15
CLOCK: [2022-11-15 Tue 19:02]--[2022-11-15 Tue 19:02] =>  0:00
:END:

Naturally it might be implemented by a single ~master~ ToDo list for
general tasks, and a bundle of ~slave~ ToDo lists, connected and
disconnected optionally, depending on current job properties.

[[info:org#Agenda Files][org#Agenda Files]]

*** Type of Tasks

It is convenient to classify the whole bunch of tasks by their nature
on several specific:

****  By the age and maturity:

Any idea, thought or note should have eough time for gestation. So,
let define /the primary set of states/ for the each new-born task:

- *Raw*, which are only /generally and basicaly defined/;
- *Init* -ial, which are noticed as more or less rational and actual
  thus being accepted and scheduled;
- *To-Do* - all that are already sieved through /minor clarificatoin/
  and became early inceptive;
- *Active* is the status for the majority of primal and current
  tasks - they are still being decent enough to spend time on
  it. Naturally most of them are complex and knotty enough to spend
  several weeks or even months on elaboration. So it is rational to
  make them periodic:
  + Regular, or repeatable or periodic;
  + Irregular;
- And, finally (and ideally;) every *Active* task ought to spawn out
  several *Raw* ones and turn into inactive state *DONE*.

On practice, a task galore requires a much more amount of time to be
dismantled. And in this case the best step further is to postpone them
on several months and switch on to /additional states sequence/


*** Re-scheduling the task

By typing ~S-right/left~ it is possible to move the schedule/deadline
date in the past or future at one day.

*** Prioritize the task

By typing ~S-up/down~ it is possible change the task's priority.

[[info:org#Priorities][org#Priorities]]

*** Change the task's state

Typing ~t~ will sequentially change the ~TODO~ state of the particular
item in the *Org-Agenda* buffer.

[[info:org#Workflow states][org#Workflow states]]
[[info:org#Multiple sets in one file][org#Multiple sets in one file]]

*** Make the task auto-repeatable

~++2d  .+1d .+2d/3d~

[[info:org#Tracking your habits][org#Tracking your habits]]

*** Annihilate the task

The most effective way to get rid of obvious litter is to kill them by
~C-k~ directly in the *Org-Agenda* buffer. It is the straight path to
~Ktulkh~.

** RETARD [#B] Data gathering
SCHEDULED: <2024-05-22 Wed .+3d/4d>
:PROPERTIES:
:LAST_REPEAT: [2023-09-22 Fri 09:55]
:END:
- State "FROZEN"     from "RAW"        [2023-09-22 Fri 09:55]
- State "FROZEN"     from "RAW"        [2023-09-22 Fri 09:55]
- State "FROZEN"     from "DELAY"      [2023-09-22 Fri 09:51]
- State "DONE"       from "ACTIVE"     [2022-11-25 Fri 07:29]
- State "DONE"       from "ACTIVE"     [2022-11-25 Fri 07:29]
- State "MAYBE"      from "ACTIVE"     [2022-11-18 Fri 07:33]
:LOGBOOK:
CLOCK: [2022-11-24 Thu 13:22]--[2022-11-24 Thu 13:34] =>  0:12
CLOCK: [2022-11-22 Tue 14:42]--[2022-11-22 Tue 15:02] =>  0:20
CLOCK: [2022-11-16 Wed 07:10]--[2022-11-16 Wed 07:36] =>  0:26
:END:

It would be successfully resolved utilizing innate =Org-mode= *capture's.*
features. All what you need to unleash its real power is to configure
its templates for capturing where you're define how and where data
will be captured and stored.

So, the common types of notes would be:

- Rough note in a short words;
- Crude note as idea and comment for it;
- Proverbs:
  + with annotation;
  + obvious enough, without any comments;
- Quotation;
- etc.

[[info:org#Capture templates][org#Capture templates]]

** RETARD Data elaboration
SCHEDULED: <2024-05-21 Tue>

** RETARD [#B] Meta-analysys
SCHEDULED: <2024-05-14 Tue .+1w>
:PROPERTIES:
:CATEGORY: Meta
:END:
:LOGBOOK:
CLOCK: [2022-12-09 Fri 11:17]--[2022-12-09 Fri 11:29] =>  0:12
:END:

~C-h l~ history of Emacs' commands 
~agenda-log-mode~

** INIT Archiving                                                  :ARCHIVE:
SCHEDULED: <2023-04-12 Wed .+1w>
:PROPERTIES:
:LAST_REPEAT: [2022-11-25 Fri 09:36]
:END:
- State "DONE"       from "ACTIVE"     [2022-11-25 Fri 09:36]
- State "MAYBE"      from "ACTIVE"     [2022-11-13 Sun 09:40]
:LOGBOOK:
CLOCK: [2022-12-09 Fri 10:45]--[2022-12-09 Fri 11:03] =>  0:18
CLOCK: [2022-11-11 Fri 09:21]--[2022-11-11 Fri 09:50] =>  0:29
:END:

Sometimes it is convenient to declutter workspace and move some
particular task to archive temporarily or permanently.

*v A*
=Trees with :ARCHIVE: tag and all active archive files are included=
*v a*
=Trees with :ARCHIVE: tag are included=

So, it is possible to archive ~TODO~ items on the fly by tagging, and
moving them to another place by commands ~org-agenda-toggle-archive-tag~
and ~org-agenda-archive~ accordingly. There are several =hot keys= to
archive some item in a special =archive file= (*$, a, C-c $*) in
*Org-Agenda* buffer by default, but there no a single one for simple
~un/tagging~. So, for convevinence, it is possible to define some
special for ~org-agenda-mode-map~ key-chord:

#+begin_src elisp
  (require 'org-agenda)
  (key-chord-define org-agenda-mode-map "za" \
                    'org-agenda-toggle-archive-tag)
#+end_src

Naturally it would be necessary to check up your archive from time to
time to ensure that its content is really redundant, move surely
unactual tasks into a separate file or, in case of erroneous
archiving - return some /seemingly/ unactual tasks back into your
current agenda. *Note* that it is much easy to ~untag~ task than move it
back from a separate file.

* Notes                                                      :noexport:notes:
 - GitHub.io with Jekyll data representation might be ideal for
   meta-analysys already collected data



 
** Temperature and Noise


** Long-term planning
 
** An Insight Incubation

It requires a lot of time to figure out what exactly your idea is.

*** Double Loop Learning

https://www.youtube.com/watch?v=83w-jFcwiX0

** Straight Work Approach

+ Work first - recover later;
- First 90 seconds after when you're wake up;
- Harness your natural (early bird) proneness;

** Shallow/deep | long/short sessions

The time is a relative term when you're in deep learning. Only few
early morning sessions could be productive and endure more than the
standart 25 minutes.

*** Regressive pomodoro

- From 45m in the morning to 25m at noon;
- Timer sound


** Change task to avoid einstulling
